"""
Вам дана последовательность строк.
Выведите строки, содержащие двоичную запись числа, кратного 3.

Двоичной записью числа называется его запись в двоичной системе счисления.

Примечание 2:
Данная задача очень просто может быть решена приведением строки к целому числу и проверке остатка от деления на три,
но мы все же предлагаем вам решить ее, не используя приведение к числу.
Sample Input:
0
10010
00101
01001
Not a number
1 1
0 0

Sample Output:
0
10010
01001


2=10

4=100
5=101

7=111
8=1000

10=1010
11=1011
    12=1100
13=1101
14=1110
    15=1111
16=10000

0=      0
3=     11
6=    110
9=   1001
12=  1100
15=  1111
18= 10010
21= 10101
24= 11000
27= 11011
30= 11110
33=100001
36=100100
39=100111
"""
import sys
import re

pattern = r'^0*(110*)*(1(01*0)*10*)*$'

for line in sys.stdin:
    line = line.rstrip()
    if re.search(pattern, line):
        print(line)
