"""
Напишите программу, которая выводит часть последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ...
(число повторяется столько раз, чему равно). На вход программе передаётся неотрицательное целое число n —
столько элементов последовательности должна отобразить программа. На выходе ожидается последовательность чисел,
записанных через пробел в одну строку.
Например, если n = 7, то программа должна вывести 1 2 2 3 3 3 4.
"""

count = int(input())
i = 0
order_number = 1
numbers = []
while i < count:
    numbers += [str(order_number)] * order_number
    i += order_number
    order_number += 1
print(" ".join(numbers[:count]))
