"""
Узнав, что ДНК не является случайной строкой, только что поступившие в Институт биоинформатики
студенты группы информатиков предложили использовать алгоритм сжатия, который сжимает повторяющиеся
символы в строке.
Кодирование осуществляется следующим образом:
s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', то есть группы одинаковых символов исходной строки
заменяются на этот символ и количество его повторений в этой позиции строки.

Напишите программу, которая считывает строку, кодирует её предложенным алгоритмом и
выводит закодированную последовательность на стандартный вывод. Кодирование должно учитывать регистр символов.
"""
print('Input string to archive')
dna_str = input()
i = 0
current_count = 0
dna_zip = ''
while i < len(dna_str):
    j = i
    current_count = 0
    while (j < len(dna_str) and dna_str[i] == dna_str[j]):
        j += 1
        current_count += 1
    dna_zip += dna_str[i] + str(current_count)
    i += current_count
print(dna_zip)
