"""
Используя принципы ООП и языка Python, опишите класс Wine, который в дальнейшем может быть применим
при создании электронного каталога вин (сам электронный каталог вин вам пока реализовывать не нужно).
Подумайте, какие поля и методы понадобятся классу Wine, для выполнения следующих функций:

1. Хранение информации о виде вина: название, торговая марка, страна, дата разлива, многострочное примечание
(может быть любое количество строк).
2. Доступ (установка и получение) к хранимой информации.
3. Расчет выдержки вина (текущая дата дается как аргумент)
"""
